
#### Terraform Plan `success`
<details><summary>Plan: 2 to add, 0 to change, 0 to destroy.
</summary>

```
azurerm_resource_group.github_tech_challenge: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge]
azurerm_app_service_plan.branch_protection_service: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/serverfarms/github-branch-protection-service]
azurerm_storage_account.branch_protection_service: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Storage/storageAccounts/liatriogithubtech]
azurerm_function_app.branch_protection_service: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/sites/github-branch-protection-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_app_service_plan.branch_protection_service has changed
  ~ resource "azurerm_app_service_plan" "branch_protection_service" {
        id                           = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/serverfarms/github-branch-protection-service"
        name                         = "github-branch-protection-service"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_function_app.branch_protection_service has changed
  ~ resource "azurerm_function_app" "branch_protection_service" {
        id                              = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/sites/github-branch-protection-service"
        name                            = "github-branch-protection-service"
      + tags                            = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # azurerm_resource_group.github_tech_challenge has changed
  ~ resource "azurerm_resource_group" "github_tech_challenge" {
        id       = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge"
        name     = "github-tech-challenge"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.branch_protection_service has changed
  ~ resource "azurerm_storage_account" "branch_protection_service" {
        id                             = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Storage/storageAccounts/liatriogithubtech"
        name                           = "liatriogithubtech"
      + tags                           = {}
        # (32 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_organization_webhook.branch_protection_service will be created
  + resource "github_organization_webhook" "branch_protection_service" {
      + active = false
      + etag   = (known after apply)
      + events = [
          + "repository",
        ]
      + id     = (known after apply)
      + url    = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # github_organization_webhook.test will be created
  + resource "github_organization_webhook" "test" {
      + active = false
      + etag   = (known after apply)
      + events = [
          + "repository",
        ]
      + id     = (known after apply)
      + url    = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>